Revit 2027 API
Transform2D.PreScale Method
 Scales the linear part of this transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform2D PreScale(
	double scale
)
Public Function PreScale (
	scale As Double
) As Transform2D
public:
Transform2D^ PreScale(
	double scale
)
member PreScale :
        scale : float -> Transform2D
Parameters
scale Double
 The scale value.
Return Value
Transform2D
 Returns a pointer to "this" Transform2D.
Remarks
 The resulting transformation is equivalent to the application of the uniform scale and then this transformation, in this order.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace